Repository: 5l1v3r1/miredo
Catalog: po/*.po
Languages: fr

source: Fatal socket error: %m
fr: Erreur fatale de socket: %m

source: Fatal bind error: %m
fr: Erreur fatale de bind(): %m

source: Teredo server UDP socket error: Server IPv4 addresses must be global unicast.
fr: Erreur de socket UDP de serveur Teredo: l'adresse IPv4 de serveur doit être globale unicast.

source: Teredo server UDP socket error: Server IPv4 addresses must not be wildcard.
fr: Erreur de socket UDP du server Teredo: les adresses IPv4 de serveur ne doivent pas être génériques.

source: Server has a non global IPv4 address. It will most likely not work.
fr: Le serveur a une adresse IPv4 non globale. Ça ne fonctionnera vraisemblablement pas.

source: Authentication refused by server.
fr: Authentification refusée par le serveur.

source: Unsupported symmetric NAT detected.
fr: NAT symmétrique non supporté détecté.

source: Qualified (NAT type: %s)
fr: Qualifié (type de NAT: %s)

source: cone
fr: cône

source: restricted
fr: restreint

source: Teredo address changed
fr: Adresse Teredo changée

source: Lost Teredo connectivity
fr: Connectivité Teredo perdue

source: Error opening %s: %m
fr: Erreur d'ouverture de %s: %m

source: Error reading random data: %m
fr: Erreur de lecture de données aléatoires: %m

source: Invalid Teredo prefix received
fr: Préfixe Teredo reçu invalide

source: IPv6 stack not available: %m
fr: Pile IPv6 non disponible: %m

source: Tunneling driver error (%s): %m
fr: Erreur du pilote de tunneling (%s): %m

source: Tunnel error (TUNSETIFF): %m
fr: Erreur de tunnel (TUNSETIFF): %m

source: Tunnel error (SIOCSIFNAME): %m
fr: Erreur de tunnel (SIOCSIFNAME): %m

source: %s tunnel error (TUNSIFHEAD): %m
fr: Erreur du tunnel %s (TUNSIFHEAD): %m

source: %s tunneling interface %s created
fr: Interface %1$s de tunneling %2$s créée

source: %s tunneling interface creation failure
fr: Échec de création de l'interface de tunneling %s

source: Tunneling interface %s removed
fr: Interface %s de tunneling supprimée

source: %s tunnel address %s/%u setup error: %m
fr: Erreur de réglage de l'adresse %2$s/%3$u pour le tunnel %1$s: %m

source: %s tunnel address %s/%u removal error: %m
fr: Erreur de suppression de l'adresse %2$s/%3$u pour le tunnel %1$s: %m

source: %s tunnel address added: %s/%u
fr: Adresse ajoutée au tunnel %s: %s/%u

source: %s tunnel address deleted: %s/%u
fr: Adresse du tunnel %s supprimée: %s/%u

source: %s tunnel route %s/%u setup error: %m
fr: Erreur de réglage de la route %2$s/%3$u pour le tunnel %1$s: %m

source: %s tunnel route %s/%u removal error: %m
fr: Erreur de suppression de la route %2$s/%3$u pour le tunnel %1$s: %m

source: %s tunnel route set: %s/%u
fr: Route définie sur le tunnel %s: %s/%u

source: %s tunnel route removed: %s/%u
fr: Route retirée du tunnel %s: %s/%u

source: You should run these commands to create it : # mkdir -p /dev/net # mknod /dev/net/tun c 10 200 (you must be root to do that).
fr: Vous devriez exécuter ces commande pour le créer : # mkdir -p /dev/net # mknod /dev/net/tun c 10 200 (vous devez être root pour cela).

source: You can obtain a tunnel driver for the Darwin kernel (Mac OS X) from : http://chrisp.de/en/projects/tunnel.html
fr: Vous pouvez obtenir un pilote de tunnel pour le noyau Darwin (Mac OS X) à : http://chrisp.de/en/projects/tunnel.html

source: Error: %s character device not found or unavailable. %s
fr: Erreur: périphérique %s non trouvé ou non disponible. %s

source: Make sure your Linux kernel includes the "Universal TUNTAP driver" (CONFIG_TUN option), possibly as a module.
fr: Vérifiez que votre noyau Linux comporte l'«Universal TUNTAP driver» (option CONFIG_TUN), éventuellement sous forme de module.

source: Error: your operating system does not seem to provide a network tunnneling device driver, which is required. %s
fr: Erreur: votre système d'exploitation semble ne pas fournir de pilote de périphérique de tunnel réseau, ce qui est indispensable. %s

source: Error: cannot open device file %s (%s) IPv6 tunneling will not work.
fr: Erreur: ouverture impossible du périphérique %s (%s) Le tunneling IPv6 ne fonctionnera pas.

source: Try "miredo -h | more" for more information.
fr: Faîtes «miredo -h | more» pour plus de détails.

source: Usage: miredo [OPTIONS] Creates a Teredo tunneling interface for encapsulation of IPv6 over UDP. -f, --foreground run in the foreground -h, --help display this help and exit -p, --pidfile override the pidfile path -u, --user override the user to set UID to -V, --version display program version and exit
fr: Usage: miredo [OPTIONS] Crée une interface de tunneling Teredo pour l'encapsulation d'IPv6 sur UDP. -f, --foreground s'exécute en avant plan -h, --help affiche cette aide et se termine -p, --pidfile spécifie le chemin vers le fichier de PID -u, --user redéfinit l'utilisateur qui exécute le programme (setuid) -V, --version affiche la version du programme et se termine

source: This is free software; see the source for copying conditions. There is NO warranty; not even for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
fr: Ce logiciel est libre; voir les sources pour les conditions de reproduction. Il n'y a AUCUNE garantie; pas même pour la COMMERCIALISATION ou l'ADÉQUATION POUR UNE UTILISATION PARTICULIÈRE.

source: Written by %s. Configured with: %s
fr: Écrit par %s. Configuré par: %s

source: Duplicate parameter "%s" for option -%c would override previous value "%s".
fr: Le paramètre doublon «%s» pour l'option -%c redéfinirait la valeur précédente «%s».

source: Invalid number (or capacity exceeded) "%s" for option -%c
fr: Nombre invalide (ou capacité dépassée) «%s» pour l'option -%c

source: %s: unexpected extra parameter
fr: %s: paramètre en trop

source: Error: missing command line parameter
fr: Erreur: paramètre de la ligne de commande manquant

source: That is usually an indication that you are trying to start the program as an user with insufficient system privileges. This program should normally be started by root.
fr: Cela signifie, en général, que vous tentez de démarrer le programme en tant qu'utilisateur avec des privilèges systèmes insuffisants. Normalement, ce programme devrait être démarré par root.

source: User not found
fr: Utilisateur non trouvé

source: Error: This program was asked to run in the security context of system user "%s", but it does not seem to exist on your system. Use command line option "-u <username>" to run this program in the security context of another user.
fr: Erreur: L'exécution de ce programme dans le contexte de sécurité de l'utilisateur système «%s» a été demandée, mais celui-ci semble ne pas exister sur votre système. Utilisez l'option de ligne de commande «-u <utilisateur>» afin d'exécuter ce programme dans le contexte de sécurité d'un autre utilisateur.

source: Error: This program is not supposed to keep root privileges. That is potentially very dangerous (all the more as it is beta quality code that has never been audited for security vulnerabilities). Besides, it does not even work properly when root privileges are kept.
fr: Erreur: Ce programme n'est pas censé garder les privilèges root. Cela est potentiellement très dangereux (d'autant plus qu'il s'agit de code de qualité «beta» qui n'a jamais été audité à la recherche de failles de sécurité). Par aileurs, le programme ne fonctionne pas correctement si les privilèges root sont conservés.

source: SetGID to group ID %u: %s
fr: SetGID vers l'ID de groupe %u: %s

source: Error: This program tried to change its system group(s) security context but it failed.
fr: Erreur: Ce programme a tenté de changer son contexte de sécurité groupe(s) système(s), mais il a échoué.

source: SetUID to root: %s
fr: SetUID vers root: %s

source: Fatal error
fr: Erreur fatale

source: Getting required capabilities
fr: Obtention des privilèges nécessaires

source: Error: This program tried to obtain required system administration privileges but it failed.
fr: Erreur: Ce programme a tenté d'obtenir des privilèges systèmes indispensables mais il a échoué.

source: Error (daemon)
fr: Erreur (daemon)

source: Read unknown option -%c : That is probably a bug. Please report it.
fr: Option lue inconnue -%c : C'est probablement un bogue. Veuillez le signaler.

source: Reading configuration from %s: %s
fr: Lecture de la configuration depuis %s: %s

source: Chroot directory %s: %s
fr: Répertoire de cloisement (chroot) %s: %s

source: Teredo tunnel setup failed: %s
fr: Mise en place du tunnel Teredo impossible: %s

source: You should be root to do that.
fr: Vous devriez être root pour faire cela.

source: Privileged process setup failed: %m
fr: Démarrage du processus privilégié impossible: %m

source: Teredo routing failed: %s
fr: Routage Teredo impossible: %s

source: Setting UID failed: %m
fr: Réglage de l'UID impossible: %m

source: Teredo server failure
fr: Défaillance du serveur Teredo

source: Teredo UDP port failure
fr: Défaillance du port UDP Teredo

source: Make sure another instance of the program is not already running.
fr: Vérifiez qu'une autre instance du programme n'est pas déjà en marche.

source: Teredo service failure
fr: Défaillance du service Teredo

source: Teredo service port failure: cannot open UDP port %u
fr: Échec du port de service Teredo: ouverture du port UDP %u impossible

source: Teredo service port failure: cannot open an UDP port
fr: Échec du port de service Teredo: ouverture d'un port UDP impossible

source: pipe failed: %m
fr: Échec de pipe: %m

source: Loading configuration from %s failed
fr: Échec du chargement de la configuration depuis %s

source: Fatal configuration error
fr: Erreur fatale de configuration

source: Fatal bind IPv4 address error
fr: Erreur fatale d'adresse IPv4

source: Fatal bind UDP port error
fr: Erreur fatale de port UDP

source: fork failed: %m
fr: Échec de fork: %m

source: Exiting on signal %d (%s)
fr: Arrêt suite au signal %d (%s)

source: Reloading configuration on signal %d (%s)
fr: Rechargement de la configuration suite au signal %d (%s)

source: Terminated (exit code: %d)
fr: Terminé (code de retour: %d)

source: Child %d killed by signal %d (%s)
fr: Fils %d tué par le signal %d (%s)

source: Superfluous directive %s at line %u
fr: Directive %s superflue à la ligne %u

source: Memory problem: %m
fr: Problème de mémoire: %m

source: Skipped overly long line %u
fr: Ligne %u trop longue ignorée

source: Ignoring line %u: %s
fr: Line %u ignorée: %s

source: Error reading configuration file: %m
fr: Erreur de lecture du fichier de configuration: %m

source: Error opening configuration file %s: %m
fr: Erreur d'ouverture du fichier de configuration %s: %m

source: Invalid integer value "%s" for %s: %m
fr: Valeur entière invalide «%s» pour %s: %m

source: Invalid boolean value "%s" for %s
fr: Valeur booléenne incorrecte «%s» pour %s

source: Invalid hostname "%s" at line %u: %s
fr: Nom d'hôte invalide «%s» à la ligne %u: %s

source: Invalid Teredo IPv6 prefix: %x::/32
fr: Préfixe Teredo IPv6 invalide: %x::/32

source: Invalid relay type "%s" at line %u
fr: Type de relais invalide «%s» à la ligne %u

source: Unknown syslog facility "%s" at line %u
fr: Catégorie syslog «%s» inconnue à la ligne %u
